Tarea1/DifusorLS2RS1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/Parametros"
dimensions      [velocity];

internalField   uniform ($Uin 0 0);

boundaryField
{
	frontAndBack
	{
		type	empty;
	}
	outlet
	{
		type	zeroGradient;
	}
	inlet
	{
		type	surfaceNormalFixedValue;
		refValue	uniform #neg $Uin ;
	}
	"(lowerWall|upperWall)"
	  {
	    type	noSlip;
	  }
}

// ************************************************************************* //
